package trainding.springcoinragsystem.chunking;

import java.util.Arrays;
import java.util.HashSet;
import java.util.Set;
import java.util.stream.Collectors;

public class StringPreparing {

    private static final Set<String> STOP_WORDS = new HashSet<>(Arrays.asList(
            "и", "в", "во", "не", "что", "он", "на", "я", "с", "со", "как", "а",
            "то", "все", "она", "так", "его", "но", "да", "ты", "к", "у", "же",
            "вы", "за", "бы", "по", "только", "ее", "мне", "было", "вот", "от",
            "меня", "еще", "нет", "о", "из", "ему", "теперь", "когда", "даже",
            "ну", "вдруг", "ли", "если", "уже", "или", "ни", "быть", "был",
            "него", "до", "вас", "нибудь", "опять", "уж", "вам", "ведь", "там",
            "потом", "себя", "ничего", "ей", "может", "они", "тут", "где",
            "есть", "надо", "ней", "для", "мы", "тебя", "их", "чем", "была",
            "сам", "чтоб", "без", "будто", "чего", "раз", "тоже", "себе",
            "под", "будет", "ж", "тогда", "кто", "этот", "того", "потому",
            "этого", "какой", "совсем", "ним", "здесь", "этом", "один",
            "почти", "мой", "тем", "чтобы", "нее", "сейчас", "были", "куда",
            "зачем", "всех", "никогда", "можно", "при", "наконец", "два",
            "об", "другой", "хоть", "после", "над", "больше", "тот", "через",
            "эти", "нас", "про", "всего", "них", "какая", "много", "разве",
            "три", "эту", "моя", "впрочем", "хорошо", "свою", "этой", "перед",
            "иногда", "лучше", "чуть", "том", "нельзя", "такой", "им", "более",
            "всегда", "конечно", "всю", "между"
    ));


    public static String cleanText(String text) {
        return text.replaceAll("[^а-яА-ЯA-Za-z0-9\\s.!?;:]", " ")
                .replaceAll("\\s+", " ")
                .toLowerCase()
                .trim();
    }

    public static String removeStopWords(String text) {
        return Arrays.stream(text.split("\\s+"))
                .filter(word -> !STOP_WORDS.contains(word))
                .collect(Collectors.joining(" "));
    }
}